{
  "trips": [
    {
      "id": 1,
      "title": "Маршрут на гору 'Плай'",
      "description": "Пізнавальна екскурсія до однієї з вершин Боржавського масиву, а саме гори Плай, де знаходяться діюча радіорелейна та метеостанція. Висота 1330 метрів над рівнем моря. В 60-ті роки ХХ століття на метеостанції працював Герой України - Вячеслав Чорновіл.",
      "time": "Тривалість походу: 5-7 годин",
      "price": "Ціна: 800 грн"
    },
    {
      "id": 2,
      "title": "Маршрут на гору Великий 'Верх'",
      "description": "Надзвичайно цікавий похід до однієї із найвищих вершин Боржавського хребта, гори \"Великий Верх\" висота якої сягає 1598 метрів. Безмежні краєвиди, буково-смерековий ліс, вражаючі панорами Карпат, легенди, цілюще повітря та багато інших див чекають на учасників експедиції.",
      "time": "Тривалість походу: 6-9 годин",
      "price": "Ціна: 900 грн"
    },
    {
      "id": 3,
      "title": "Маршрут на гору 'Гембу'",
      "description": "Захоплююча мандрівка через села Подобовець та Пилипець до вершини Боржавського хребта висотою 1491 метр над рівнем моря. Знакова вершина для тих хто любить екстремальний відпочинок. Місце проведення міжнародних та національних змагань з парапланеризму, фрірайду, даунхілу.",
      "time": "Тривалість походу: 8-10 годин",
      "price": "Ціна: 900 грн"
    },
    {
      "id": 4,
      "title": "Маршрут на гору 'Стой'",
      "description": "Неповторна експедиція до найвищої вершини Боржавського масиву 1681 метр над рівнем моря. Прекрасні краєвиди, надзвичайні емоції та враження, маса адреналіну. Вершина гори Стой в часи СРСР була стратегічним військовим об`єктом. Про все це і багато чого цікавого - в процесі мандрівки.",
      "time": "Тривалість походу: 10-14 годин",
      "price": "Ціна: 1000 грн"
    },
    {
      "id": 5,
      "title": "Маршрут на гору 'Пікуй'",
      "description": "Автобусно-пішохідний маршрут. Незабутня екскурсія-похід до найвищої вершини Львівської області, що знаходиться на висоті 1408 метрів над рівнем моря. В минулому столітті по вершині гори також проходив кордон між державами. Безліч позитивних вражень, захоплюючі природні ландшафти, легенди оповідання, гірські потічки, царство пралісів і ще багато приємних відкриттів чекає на Вас.",
      "time": "Тривалість походу: 10-14 годин",
      "price": "Ціна: 1000 грн"
    },
    {
      "id": 6,
      "title": "Маршрут по 'Бескидах'",
      "description": "Унікальна подорож до Верховинського вододільного хребта. Місця де колись проходив кордон між Чехословаччиною та Польщею, Угорщиною та СРСР. Знайомство із історією будівництва Бескидської залізниці та Карпатських тунелів, що розпочалось в 1872 році і з'єднало Відень та Львів.",
      "time": "Тривалість походу: 8-10 годин",
      "price": "Ціна: 1000 грн"
    }
  ]


}