{
  "profileInfo": {
    "title": "Про себе",
    "text": "Життя - це постійний пошук та відкриття все нових, цікавих сторінок, а тому - подорож так приваблює людину. Запропонована Вам програма відпочинку - це бажання надати мандрівникові якомога більше інформації про географію, історію, культуру й туризм на території Воловецько - Міжгірської Верховини та й Закарпатті, загалом! Сподіваюсь, що моя інформація, допоможе Вам знайти щось цікаве для себе, спланувати відпочинок і зробити перший крок у відкритті та знайомстві з регіоном! Чудовою нагодою розпочати подорож Закарпаттям є знайомство з його наймальовничішим куточком - Воловеччиною та Міжгірщиною! Пішохідний туризм - найдоступніший вид активного відпочинку на Закарпатті. Незнайомі маршрути і важкопрохідні стежки - подарують Вам відчуття справжніх пригод! Пропоную гостям Воловеччини одноденні туристичні походи: пішохідні та комбіновані автобусно - пішохідні; а також велосипедні та квадроциклетні маршрути, рафтинг по Тисі, польоти на параплані, катання на конях, купання в чанах та термальних басейнах, дегустації вина, сиру, закарпатських страв, цікаву культурно - мистецьку програму та цілий спектр різноманітних напрямків туристичного відпочинку! В зимовий період запропоную не менш захоплюючий гірськолижний відпочинок!"
  },
  "trips": [
    {
      "id": 1,
      "img": "https://scontent.fudj2-1.fna.fbcdn.net/v/t39.30808-6/243590472_1517428158619294_8373807635638149234_n.jpg?_nc_cat=111&ccb=1-5&_nc_sid=730e14&_nc_ohc=VrFJhPm_Hn8AX_JXLQH&_nc_ht=scontent.fudj2-1.fna&oh=a021961c932e081a930d5830b2b92e04&oe=619B5E8F",
      "title": "Маршрут на гору 'Плай'",
      "description": "Пізнавальна екскурсія до однієї з вершин Боржавського масиву, а саме гори Плай, де знаходяться діюча радіорелейна та метеостанція. Висота 1330 метрів над рівнем моря. В 60-ті роки ХХ століття на метеостанції працював Герой України - Вячеслав Чорновіл.",
      "time": "Тривалість походу: 5-7 годин",
      "price": "Ціна: 800 грн"
    },
    {
      "id": 2,
      "img": "https://scontent.fudj2-1.fna.fbcdn.net/v/t39.30808-6/243586743_1517428281952615_1274615133517468047_n.jpg?_nc_cat=103&ccb=1-5&_nc_sid=730e14&_nc_ohc=HbxUkDm1v4oAX9w1g-7&_nc_ht=scontent.fudj2-1.fna&oh=01191f3833dce548230e84e6719b3a60&oe=619AC153",
      "title": "Маршрут на гору Великий 'Верх'",
      "description": "Надзвичайно цікавий похід до однієї із найвищих вершин Боржавського хребта, гори \"Великий Верх\" висота якої сягає 1598 метрів. Безмежні краєвиди, буково-смерековий ліс, вражаючі панорами Карпат, легенди, цілюще повітря та багато інших див чекають на учасників експедиції.",
      "time": "Тривалість походу: 6-9 годин",
      "price": "Ціна: 900 грн"
    },
    {
      "id": 3,
      "img": "https://scontent.fudj2-1.fna.fbcdn.net/v/t39.30808-6/243292858_1517428125285964_3998230966417881593_n.jpg?_nc_cat=107&ccb=1-5&_nc_sid=730e14&_nc_ohc=1LvldC1nwbIAX9YnFv0&_nc_ht=scontent.fudj2-1.fna&oh=8f1e8dc4d5afe0a4d2ba2eeda88cbe74&oe=619B5C97",
      "title": "Маршрут на гору 'Гембу'",
      "description": "Захоплююча мандрівка через села Подобовець та Пилипець до вершини Боржавського хребта висотою 1491 метр над рівнем моря. Знакова вершина для тих хто любить екстремальний відпочинок. Місце проведення міжнародних та національних змагань з парапланеризму, фрірайду, даунхілу.",
      "time": "Тривалість походу: 8-10 годин",
      "price": "Ціна: 900 грн"
    },
    {
      "id": 4,
      "img": "https://scontent.fudj2-1.fna.fbcdn.net/v/t39.30808-6/243321940_1517428238619286_4229638871974385508_n.jpg?_nc_cat=104&ccb=1-5&_nc_sid=730e14&_nc_ohc=9vwKVUMxmqIAX8e6PrH&_nc_ht=scontent.fudj2-1.fna&oh=f721b752dc2ab0f9a4fe99da05fe5428&oe=619B1E4E",
      "title": "Маршрут на гору 'Стой'",
      "description": "Неповторна експедиція до найвищої вершини Боржавського масиву 1681 метр над рівнем моря. Прекрасні краєвиди, надзвичайні емоції та враження, маса адреналіну. Вершина гори Стой в часи СРСР була стратегічним військовим об`єктом. Про все це і багато чого цікавого - в процесі мандрівки.",
      "time": "Тривалість походу: 10-14 годин",
      "price": "Ціна: 1000 грн"
    },
    {
      "id": 5,
      "img": "https://scontent.fudj2-1.fna.fbcdn.net/v/t39.30808-6/243442487_1517428075285969_6610711803286200816_n.jpg?_nc_cat=108&ccb=1-5&_nc_sid=730e14&_nc_ohc=In4lu0hbkOMAX-qdkc3&_nc_ht=scontent.fudj2-1.fna&oh=2c495ac63cd93f3ea2a9793d0374926f&oe=619C7798",
      "title": "Маршрут на гору 'Пікуй'",
      "description": "Автобусно-пішохідний маршрут. Незабутня екскурсія-похід до найвищої вершини Львівської області, що знаходиться на висоті 1408 метрів над рівнем моря. В минулому столітті по вершині гори також проходив кордон між державами. Безліч позитивних вражень, захоплюючі природні ландшафти, легенди оповідання, гірські потічки, царство пралісів і ще багато приємних відкриттів чекає на Вас.",
      "time": "Тривалість походу: 10-14 годин",
      "price": "Ціна: 1000 грн"
    },
    {
      "id": 6,
      "img": "https://scontent.fudj2-1.fna.fbcdn.net/v/t39.30808-6/243328921_1517428138619296_9157750498441368198_n.jpg?_nc_cat=110&ccb=1-5&_nc_sid=730e14&_nc_ohc=d4S4BSwxBBYAX92Ossc&_nc_ht=scontent.fudj2-1.fna&oh=003dba68053c8edadf4e7c28236b2f14&oe=619ADA14",
      "title": "Маршрут по 'Бескидах'",
      "description": "Унікальна подорож до Верховинського вододільного хребта. Місця де колись проходив кордон між Чехословаччиною та Польщею, Угорщиною та СРСР. Знайомство із історією будівництва Бескидської залізниці та Карпатських тунелів, що розпочалось в 1872 році і з'єднало Відень та Львів.",
      "time": "Тривалість походу: 8-10 годин",
      "price": "Ціна: 1000 грн"
    }
  ],
  "treks": [
    {
      "title": "Похід на Гору Піп Іван",
      "text": "Одна з найвищих вершин Українських Карпат, з висотою 2028 м. Розташована на південно-східному кінці головного хребта масиву Чорногора, на межі Івано-Франківської та Закарпатської областей. На вершині гори знаходяться руїни польської астрономо-метеорологічної обсерваторії, частково відновлені для туристичних потреб і відомі під сучасною популярною назвою «Білий Слон».",
      "img": "/static/media/trekimg.07865116.jpg",
      "id": 1
    },
    {
      "title": "Похід на Чорногірський Хребет",
      "text": "Найвищий гірський масив Українських Карпат, до нього належить г. Говерла, найвища точка України з висотою 2061 м. Розташований на схід від Полонинського Бескиду. Головний хребет простягається на довжину бл. 40 км між долинами річок Чорної Тиси на заході і Чорного Черемоша на сході.",
      "img": "/static/media/trekimg.07865116.jpg",
      "id": 2
    },
    {
      "title": "Похід на Говерлу",
      "text": "Найвища вершина Українських Карпат і найвища точка України, її висота становить 2 061 м над рівнем моря. Розташована в гірському масиві Чорногора на межі Яремчанської міськради Івано-Франківської області та Рахівського району Закарпатської області за 17 кілометрів від кордону з Румунією. Популярний об'єкт літнього та зимового туризму. Перший туристичний маршрут зі сходження на вершину був відкритий 1880 року. Взимку альпіністським сходженням на Говерлу присвоєна категорія 1Б. У кінці березня щорічно, починаючи з 1964 року, відбувається «Говерляна» — традиційний масовий похід-сходження на г. Говерлу, який присвячується відкриттю спортивного літнього сезону на Львівщині й пам'яті загиблих товаришів-альпіністів і туристів. Сходження здійснюється за маршрутом: зі сторони селища Ворохта Івано-Франківської області ущелиною річки Прут — через Карпатський національний природний парк та урочище «Заросляк».",
      "img": "/static/media/trekimg.07865116.jpg",
      "id": 3
    }
  ]
}