import React, { useEffect } from 'react';
import { connect } from 'react-redux';
import ExcursionItem from './ExcursionItem/ExcursionItem';
import getExcursions from '../../../redux/Excursion/excursionsOperations';
import styles from './ExcursionsSection.module.scss';
import loadStyles from '../ProfileSection/Profile/Profile.module.scss';

const ExcursionsSection = props => {
  useEffect(() => {
    props.getExcursions();
  }, []);

  if (props.loading) {
    return (
      <div className={loadStyles.loadingStyle}>
        <h2>Loading...</h2>
      </div>
    );
  }

  return (
    <section className={styles.container}>
      {props.trips.map(trip => (
        <ExcursionItem
          key={trip.id}
          excursion={{
            img: trip.img,
            title: trip.title,
            text: trip.description,
            time: trip.time,
            price: trip.price,
          }}
        />
      ))}
    </section>
  );
};

const mapStateToProps = state => ({
  trips: state.excursions.trips,
  loading: state.excursions.loading,
});

const mapDispatchToProps = {
  getExcursions,
};

export default connect(mapStateToProps, mapDispatchToProps)(ExcursionsSection);

//
// const ExcursionsSection = () => {
//   const [excursions, setExcursions] = useState([
//     {
//       id: 1,
//       img: Play,
//       title: 'Маршрут на гору "Плай"',
//       text:
//         'Пізнавальна екскурсія до однієї з вершин Боржавського масиву, ' +
//         'а саме гори Плай, де знаходяться діюча радіорелейна та метеостанція.' +
//         ' Висота 1330 метрів над рівнем моря. В 60-ті роки ХХ століття на метеостанції' +
//         ' працював Герой України - Вячеслав Чорновіл.',
//       time: 'Тривалість походу: 5-7 годин',
//       price: 'Ціна: 800 грн',
//     },
//
//     {
//       id: 2,
//       img: VV2,
//       title: 'Маршрут на гору "Великий Верх"',
//       text:
//         'Надзвичайно цікавий, пізнавальний похід до однієї із найвищих вершин Боржавського хребта,' +
//         ' гори "Великий Верх" висота якої сягає 1598 метрів над рівнем моря. Безмежні краєвиди, ' +
//         'буково-смерековий ліс, вражаючі панорами Карпат, легенди, цілюще повітря та багато інших див ' +
//         'чекають на учасників експедиції.',
//       time: 'Тривалість походу: 6-9 годин',
//       price: 'Ціна: 900 грн',
//     },
//
//     {
//       id: 3,
//       img: Gemba,
//       title: 'Маршрут на гору "Гембу"',
//       text:
//         'Захоплююча мандрівка через села Подобовець та Пилипець до вершини Боржавського хребта' +
//         ' висотою 1491 метр над рівнем моря. Знакова вершина для тих хто любить екстремальний відпочинок.' +
//         ' Місце проведення міжнародних та національних змагань з парапланеризму, фрірайду, даунхілу.' +
//         ' Унікальні краєвиди, безліч вражень та хорошого настрою, цікаві історії та бувальщини.',
//       time: 'Тривалість походу: 8-10 годин',
//       price: 'Ціна: 900 грн',
//     },
//
//     {
//       id: 4,
//       img: Stoy,
//       title: 'Маршрут на гору "Стой"',
//       text:
//         'Неповторна експедиція до найвищої вершини Боржавського масиву 1681 метр над рівнем моря.' +
//         ' Прекрасні краєвиди, надзвичайні емоції та враження, маса адреналіну. ' +
//         "Вершина гори Стой в часи СРСР була стратегічним військовим об'єктом. " +
//         'Про все це і багато чого цікавого - в процесі мандрівки.',
//       time: 'Тривалість походу: 10-14 годин',
//       price: 'Ціна: 1000 грн',
//     },
//
//     {
//       id: 5,
//       img: Pikyi,
//       title: 'Маршрут на гору "Пікуй"',
//       text:
//         'Автобусно-пішохідний маршрут. Незабутня екскурсія-похід до найвищої вершини' +
//         ' Львівської області, що знаходиться на висоті 1408 метрів над рівнем моря.' +
//         ' В минулому столітті по вершині гори також проходив кордон між державами. ' +
//         'Безліч позитивних вражень, захоплюючі природні' +
//         ' ландшафти, легенди оповідання, гірські потічки, царство пралісів і ще багато приємних' +
//         ' відкриттів чекає на Вас.',
//       time: 'Тривалість походу: 10-14 годин',
//       price: 'Ціна: 1000 грн',
//     },
//
//     {
//       id: 6,
//       img: Beskidy,
//       title: 'Маршрут по "Бескидах"',
//       text:
//         'Унікальна подорож до Верховинського вододільного хребта.' +
//         ' Місця де колись проходив кордон між Чехословаччиною та Польщею,' +
//         ' Угорщиною та СРСР. Знайомство із історією будівництва Бескидської ' +
//         "залізниці та Карпатських тунелів, що розпочалось в 1872 році і з'єднало" +
//         ' Відень та Львів.',
//       time: 'Тривалість походу: 8-10 годин',
//       price: 'Ціна: 1000 грн',
//     },
//   ]);
//
//   return (
//     <section className={styles.container}>
//       {excursions.map(excursion => (
//         <ExcursionItem excursion={excursion} key={excursion.id} />
//       ))}
//     </section>
//   );
// };
//
// export default ExcursionsSection;
